{
  "VUPShionMod:SpireHeart_Shion": {
    "NAME": "Spire Heart",
    "DESCRIPTIONS": [
      "NL You imbue your Funnels with all the energy you have..."
    ],
    "OPTIONS": [
    ]
  },
  "VUPShionMod:SpireHeart_WangChuan": {
    "NAME": "Spire Heart",
    "DESCRIPTIONS": [
      "NL You enchant your blade with your remaining magia..."
    ],
    "OPTIONS": [
    ]
  },
  "VUPShionMod:CroissantEvent": {
    "NAME": "Croissant",
    "DESCRIPTIONS": [
      "Something resembling a dragon's horn catches your attention. NL No...no dragon's horn, upon closer inspection it is a croissant on the floors.",
      "Just when you pick it up, you hear a voice laughing “Fus Roh Dah！” full of playful implication. Before you could think, you are carried away by a sudden thrust of wind and lose consciousness...",
      "You just obtained a croissant to replenish energy and serve as food reserve. （It has a name #yCloyce written on it. Seems you may have left someone hungry, much probably...）",
      "You are more of a rice person who hates the crumbs you may left about while eating breads, so goodbye."
    ],
    "OPTIONS": [
      "[Pick It Up] #r25%: Lose 15 HP, #g75%: Obtain Croissant.",
      "[Ignore]",
      "[Leave]"
    ]
  },
  "VUPShionMod:LostEquipment": {
    "NAME": "Lost Equipment",
    "DESCRIPTIONS": [
      "On your ascension, you find a lost equipment from the battlefield. It is all worn out and will not function until you do something about it.",
      "You leave this place."
    ],
    "OPTIONS": [
      "[Stitch] #rLose 100 gold. #gObtain Optical Camouflage.",
      "[Locked] No less than 100 gold is required.",
      "[Repair] #rRemove a random card. #gObtain Sniperscope.",
      "[Locked] No less than 1 card is required.",
      "[Leave]"
    ]
  },
  "VUPShionMod:BreakAppointment": {
    "NAME": "Gu~gu~gu!",
    "DESCRIPTIONS": [
      "You encounter a pigeon holding a pen in its beak. It's staring right straightly at you without showing any intention. What do you do?",
      "The pigeon draws something with the pen in its beak and flees away with the gold, leaving you to the figures of absolute ambiguity on the ground.",
      "The pigeon suddenly snatches the gold from your hand and vanishes into the sky before you could even react.",
      "Hmmm...Coming soon, no rush!"
    ],
    "OPTIONS": [
      "[Feed] #rLose 50 gold. #g75%:Obtain a #yCloyce card.",
      "[Locked] No less than 50 gold is required.",
      "[Gu!]",
      "[Leave]"
    ]
  },
  "VUPShionMod:Newborn": {
    "NAME": "A Message",
    "DESCRIPTIONS": [
	  "As you are about to depart, a message come to you.",
      "It's from Anastasia. Again, @total@ @devastation@ is about to be brought to a planet by an atrocious invasion, which just smacks of your past."
    ],
    "OPTIONS": [
      "[Proceed] ...",
      "[Not This Time!] Battle Ahead. #gObtain Anastasia Droplet.",
      "[Return Home]",
      "[Locked] Further Update Awaits."
    ]
  },
   "VUPShionMod:Contact": {
    "NAME": "",
    "DESCRIPTIONS": [
      "As you are about to depart, a message come to you.",
      "Necessary information is gathered and analyzed as you leave the Spire to its mayhem along your ascension. Revelations about the creators of this towering sprawl unfolds, and their coordinates too, with an expectation of numerous hostile creatures."
    ],
    "OPTIONS": [
      "[Proceed] ...",
      "[Fists Can Talk!] Battle Ahead.(work in progress)",
      "[Return Home]",
      "[Locked] Further Update Awaits."
    ]
  }
}
