{
  "VUPShionMod:SpireHeart_Shion": {
    "NAME": "Spire Heart",
    "DESCRIPTIONS": [
      "NL You imbue your Funnels with all the energy you have..."
    ],
    "OPTIONS": [
    ]
  },
  "VUPShionMod:SpireHeart_WangChuan": {
    "NAME": "Spire Heart",
    "DESCRIPTIONS": [
      "NL You enchant your blade with your remaining magia..."
    ],
    "OPTIONS": [
    ]
  },
  "VUPShionMod:SpireHeart_Liyezhu": {
    "NAME": "Spire Heart",
    "DESCRIPTIONS": [
      "NL To the ecstatic pulse, you hold the last trace of sanity to say the prayer..."
    ],
    "OPTIONS": [
    ]
  },
  "VUPShionMod:CroissantEvent": {
    "NAME": "Croissant",
    "DESCRIPTIONS": [
      "Something resembling a dragon's horn catches your attention. NL No...no dragon's horn, upon closer inspection it is a croissant on the floors.",
      "Just when you pick it up, you hear a voice laughing “Fus Roh Dah！” full of playful implication. Before you could think, you are carried away by a sudden thrust of wind and lose consciousness...",
      "You just obtained a croissant to replenish energy and serve as food reserve. (It has a name #yCloyce written on it. Seems you may have left someone hungry, much probably...)",
      "You are more of a rice person who hates the crumbs you may leave about while eating breads, so goodbye."
    ],
    "OPTIONS": [
      "[Pick It Up] #r25%: Lose 15 HP, #g75%: Obtain Croissant.",
      "[Ignore]",
      "[Leave]"
    ]
  },
  "VUPShionMod:LostEquipment": {
    "NAME": "Lost Equipment",
    "DESCRIPTIONS": [
      "On your ascension, you find a lost equipment from the battlefield. It is all worn out and will not function until you do something about it.",
      "You leave this place."
    ],
    "OPTIONS": [
      "[Stitch] #rLose 100 gold. #gObtain Optical Camouflage.",
      "[Locked] No less than 100 gold is required.",
      "[Repair] #rRemove a random card. #gObtain Sniperscope.",
      "[Locked] No less than 1 card is required.",
      "[Leave]"
    ]
  },
  "VUPShionMod:BreakAppointment": {
    "NAME": "Gu~gu~gu!",
    "DESCRIPTIONS": [
      "You encounter a pigeon holding a pen in its beak. It's staring right straightly at you without showing any intention. What do you do?",
      "The pigeon draws something with the pen in its beak and flees away with the gold, leaving you to the figures of absolute ambiguity on the ground.",
      "The pigeon suddenly snatches the gold from your hand and vanishes into the sky before you could even react.",
      "Hmmm...Coming soon, no rush!"
    ],
    "OPTIONS": [
      "[Feed] #rLose 50 gold. #g50%:Choose and obtain a #yCloyce card.",
      "[Locked] No less than 50 gold is required.",
      "[Gu!]",
      "[Leave]",
      "Chose a card add into your deck"
    ]
  },
  "VUPShionMod:Newborn": {
    "NAME": "A Message",
    "DESCRIPTIONS": [
	  "As you are about to depart, a message come to you.",
      "It's from Anastasia. Again, @total@ @devastation@ is about to be brought to a planet by an atrocious invasion, which has manifested itself as an echo of your past."
    ],
    "OPTIONS": [
      "[Proceed] ...",
      "[Not This Time!] Battle Ahead. #gObtain Anastasia Droplet.",
      "[Return Home]",
      "[Locked] Further Update Awaits."
    ]
  },
   "VUPShionMod:Contact": {
    "NAME": "Unexpected Contact",
    "DESCRIPTIONS": [
      "As you are about to depart, a message come to you.",
      "Necessary information is gathered and analyzed as you leave the Spire to its mayhem along your ascension. Revelations about the creators of this towering sprawl unfolds, and their coordinates too, with an expectation of numerous hostile creatures' presence."
    ],
    "OPTIONS": [
      "[Proceed] ...",
      "[Fists Can Talk!] Battle Ahead. #gObtain Tracking Beacon.",
      "[Return Home]",
      "[Locked] Further Update Awaits."
    ]
  },
  "VUPShionMod:LakeAmidst": {
    "NAME": "Lake on the Spire",
    "DESCRIPTIONS": [
      "The stroke of moonlight and the susurrus of the breeze has set your mind empty, as your sight returns, a vast mirror of water lays bare in your eyes.",
      "You decide to avail yourself of this idyllic scenery. A nap at ease, maybe?",
      "You decide to indulge your curiosity that is readily tickled by its underwater scenery. You segregate the water into two, letting out a gorge with fish schooling aside the crack. ",
      "You decide to meander about the mid-lake to take a closer inspection. You rove above the water, and by your patter, the reflections of the moon gently fluctuate splintered.",
      "Maybe next time..."
    ],
    "OPTIONS": [
      "[Camp] #gGain 10 Max HP.",
      "[View Underwater] #gObtain 1 Sever Current.",
      "[To the Mid-lake] #rRemove all Slide and Multi Slide, #gObatin 3 Moonstrider.",
      "[Locked] Slide or Multi Slide is required.",
      "[Leave]"
    ]
  },
  "VUPShionMod:BoundaryOfChaos": {
    "NAME": "Boundary of Chaos",
    "DESCRIPTIONS": [
      "You trudge into a remnant in an enormous disorder of the elements, where the odor of an antediluvian war still lingers. Peculiar hue condenses in the atomsphere as you contrive to sense its origin.",
      "As you try to feel it with spiritual power, an indistinguishable element slips into your strength.",
      "As you try to trap it with spiritual power, an indistinguishable element joins your mind, manifesting great activity.",
      "As you try to manupulate it with spiritual power, an indistinguishable element stampedes and ultimately abides in you, fueling you with a motley yet immense source of power.",
      "Maybe next time..."
    ],
    "OPTIONS": [
      "[Feel It] #gObtain 1 Codex Chai.",
      "[Locked] Any universal Codex is required.",
      "[Trap It] #gObtain 1 upgraded Codex Chai.",
      "[Locked] Any upgraded universal Codex is required.",
      "[Manupulate It] #gObtain 1 Chaos Intensus",
      "[Locked] Any twiced upgraded universal Codex is required.",
      "[Leave]"
    ]
  },
  "VUPShionMod:DaysGoneBy": {
    "NAME": "Sweet Memories",
    "DESCRIPTIONS": [
      "You see debris of what seems to be your memory being placed on a stone pedestal. NL ——'It's the time now. Bid farewell to me with some affections, will you?'  NL ——'I only wish for the futility of such farewells. I shall be waiting to welcome your safe return.'",
      "The memory weighs in with determination. Your face registers a smile in relief, your blade echoes to the pulse of your melted heart.",
      "The memory kindles strength within you. The necklace sprawls on the pedestal, its owner and her name blazes reminiscently in your memory.",
      "——'Unless I meet my mortality sooner than you.'  NL NL No, she can not have heard you whispering that one. You smile in relief, lay a necklace by the pedestal out of your sigil, and proceed again."
    ],
    "OPTIONS": [
      "[I am Resolved] #gObtain Ruby Key.",
      "[I am Empowered] #gObatin Sapphire Rose Necklace.",
      "[Piece Together] #gIntegrate the shards of memory, gain 30 Sanity.",
      "[Leave]"
    ]
  },
  "VUPShionMod:MentalBreakdown": {
    "NAME": "Mental Breakdown",
    "DESCRIPTIONS": [
      "“Bang...bang...bang...” NL Under a tall, looming dome that seems to hem you in, a sudden bump develops and shoots through your mind, and it is growing to full stretch to your groan... NL Frost starts to permeate the chest as your find its implication of an awakening existence... she who was rejected and frozen long ago.",
      "You acquiesce in her attempt to wake up...  NL Soberness follows a trance. The bump is gone, nothing is agitating any longer, and memories are dead. NL “Why...bother...to reject...her? And...who am...I?” NL “You are the abyss, my precious container.” NL The strings of sanity snap to her gentle voice.",
      "You destroy your sigil to stop her advent... NL “No, no way...Shut up! You!” NL Your mind is boiling, almost vaporized by the relentless whispering instigations...But those are not enough to force you out of her way. NL You raise you sword, point the tip against your chest...",
      "You suppress her awakening... NL “————” NL In the vortex of spiritual unrest, you murmur, you whisper prayer, you bear the anguish. NL All of a sudden, a shaft of light filters through, the chaos and agitation is cleansed at touch... NL She is asleep again, so that you may stagger on with your weak body."
    ],
    "OPTIONS": [
      "[Acquiesce] #rLose all Sanity. #gObtain Abyssal Crux.",
      "[Destroy the Sigil] #rRemove all Prayer cards. #gObtain Calamity.",
      "[Suppress] #rRemove a random power card, lose 20 Max HP. #gGain 50 Sanity.",
      "[Leave]"
    ]
  },
  "VUPShionMod:DistantMemory": {
    "NAME": "Distant Memory",
    "DESCRIPTIONS": [
      "A fragment of memory emerges from the bottom... NL ——“Apart from other modifications, you now have this, in case you lose control again.” Shion said as she pointed the ring-shaped...object around your ankle. NL ——“Inhibitor Prototype 03, my own creation, and the name, too. It can help you to chill out should any abnormal fluctuation of your emotion is detected...Or more likely, it compels...?” NL ——“Sounds great. But why anklets?” NL ——“Well...a part of my...sick interest?”Shion laughed. “It is sick.” You murmured, eyes averted to the empty hall “You fool...You don't need to do this to keep me at your side.”",
      "You drop your head, soothed by the aureole dancing on your ankle, and the light emenating from it.",
      "You stretch out your hand, but the aureole is giving nothing. “Just now, please...something to keep me going...”"
    ],
    "OPTIONS": [
      "[Activate Program] #gObtain Inhibitor Prototype 03.",
      "[Modify Program] #gReplace starter relic as Hallowed Case.",
      "[Leave]"
    ]
  },
  "VUPShionMod:Prophesy": {
    "NAME": "Omens of Unknown",
    "DESCRIPTIONS": [
      "The instigating unrest is now gradually settling...But somehow it gives you the inkling of something far worse, the doom that entwines you all...",
      "You have seen it once, and you know where the target is."
    ],
    "OPTIONS": [
      "[Proceed] ...",
      "[Engage!] Battle Ahead. #gObtain Unknown Dust.",
      "The body is too exhausted to go on...",
      "[Locked] Further Update Awaits."
    ]
  },
  "VUPShionMod:VacuumRipples": {
    "NAME": "Ripples of Vacuum",
    "DESCRIPTIONS": [
      "The magia circulates, the vacuum ripples, you can sense that sea of energy on the other side of the timeline...",
      "Infinite...power.",
	  "An enormous flow of magia baptizes your body..."
    ],
    "OPTIONS": [
      "[Commune] #gObtain Anima Virtutis.",
      "[Strengthen] #gGain 20 Max HP.",
      "[Locked] At least 3 Magiam Obruor cards are required.",
      "[Leave]"
    ]
  }
}
